bahmed-bm/embedded-wireless-framework/examples/STM32U585_Discovery_GCC/ewf_test_tx_bg96_stmod/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "app_threadx.h"
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include <stdlib.h>

#include "stm32u5xx_hal.h"
#include "stm32u5xx_ll_bus.h"
#include "stm32u5xx_ll_rcc.h"
#include "stm32u5xx_ll_system.h"
#include "stm32u5xx_ll_utils.h"
#include "stm32u5xx_ll_pwr.h"
#include "stm32u5xx_ll_exti.h"
#include "stm32u5xx_ll_gpio.h"
#include "stm32u5xx_ll_usart.h"

#define QUECTEL_BG96 		1
#define RENESAS_RYZ024A 	2

#define NX_DISABLE_ERROR_CHECKING
#define MODEM_TYPE RENESAS_RYZ024A


#include "ewf_lib.c"
#include "ewf_platform_threadx.c"
#include "ewf_allocator.c"
#include "ewf_allocator_threadx.c"
#include "ewf_tokenizer.c"
#include "ewf_tokenizer_basic.c"
#include "ewf_interface.c"
#include "ewf_interface_stm32_uart.c"
#include "ewf_adapter.c"
#include "ewf_adapter_api_control.c"
#include "ewf_adapter_api_info.c"
#include "ewf_adapter_api_tls_basic.c"
#include "ewf_adapter_api_mqtt_basic.c"
#include "ewf_adapter_api_tcp.c"
#include "ewf_adapter_api_udp.c"
#include "ewf_adapter_api_modem.c"
#include "ewf_adapter_api_modem_general.c"
#include "ewf_adapter_api_modem_network_service.c"
#include "ewf_adapter_api_modem_packet_domain.c"
#include "ewf_adapter_api_modem_sim_utility.c"
#include "ewf_adapter_api_modem_sms.c"
#if(MODEM_TYPE == QUECTEL_BG96)
# include "ewf_adapter_quectel_bg96.c"
# include "ewf_adapter_quectel_common_tokenizer.c"
# include "ewf_adapter_quectel_common_urc.c"
# include "ewf_adapter_quectel_common_control.c"
# include "ewf_adapter_quectel_common_context.c"
# include "ewf_adapter_quectel_common_info.c"
# include "ewf_adapter_quectel_common_internet.c"
# include "ewf_adapter_quectel_common_ufs.c"
# include "ewf_adapter_quectel_common_mqtt_basic.c"
# include "ewf_adapter_quectel_common_tls_basic.c"
# include "test/ewf_adapter_quectel_bg96_test.c"
#endif

#if(MODEM_TYPE == RENESAS_RYZ024A)
# include "ewf_adapter_renesas_ryz024a.c"
# include "ewf_adapter_renesas_common_tokenizer.c"
# include "ewf_adapter_renesas_common_urc.c"
# include "ewf_adapter_renesas_common_control.c"
//# include "ewf_adapter_renesas_common_context.c"
# include "ewf_adapter_renesas_common_info.c"
# include "ewf_adapter_renesas_common_internet.c"
//# include "ewf_adapter_renesas_common_ufs.c"
# include "ewf_adapter_renesas_common_mqtt_basic.c"
# include "ewf_adapter_renesas_common_tls_basic.c"

#endif

#include "ewf_example.config.h"

#include "ewf_netxduo_ppp.c"
#include "examples/ewf_example_netx_duo_ppp_test.c"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
#if defined ( __GNUC__) && !defined(__clang__)
/* With GCC, small printf (option LD Linker->Libraries->Small printf
   set to 'Yes') calls __io_putchar() */
#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif /* __GNUC__ */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart3;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void SystemPower_Config(void);
static void MX_GPIO_Init(void);
static void MX_ICACHE_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USART1_UART_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* Define the thread for running Azure SDK on ThreadX (THREADX IoT Platform).  */
#ifndef SAMPLE_STACK_SIZE
#define SAMPLE_STACK_SIZE      (2048)
#endif /* SAMPLE_STACK_SIZE  */

#ifndef SAMPLE_THREAD_PRIORITY
#define SAMPLE_THREAD_PRIORITY (4)
#endif /* SAMPLE_THREAD_PRIORITY  */

/* The thread control block  */
static TX_THREAD  sample_thread;

/* Define the thread stack.  */
static ULONG sample_thread_stack[SAMPLE_STACK_SIZE / sizeof(ULONG)];

/* The EWF NetX Duo PPP test.  */
ewf_result ewf_example_netx_duo_ppp_test(ewf_adapter* adapter_ptr);


void ewf_quectel_bg96_power_on()
{
	/* Reference: Quectel BG96 Hardware Design V1.4 */
	HAL_GPIO_WritePin(STMD_RESET_GPIO_Port, STMD_RESET_Pin, GPIO_PIN_SET); // bahmed GPIO_PIN_RESET
	HAL_GPIO_WritePin(STMD_PWR_EN_GPIO_Port, STMD_PWR_EN_Pin, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(STMD_DTR_GPIO_Port, STMD_DTR_Pin, GPIO_PIN_RESET);

	/* Turn OFF the module, in case of error in previous power cycle
	 * Set the STMD_PWR_EN_Pin to at least 650ms */
	HAL_GPIO_WritePin(STMD_PWR_EN_GPIO_Port, STMD_PWR_EN_Pin, GPIO_PIN_SET);
	tx_thread_sleep(70U);
	HAL_GPIO_WritePin(STMD_PWR_EN_GPIO_Port, STMD_PWR_EN_Pin, GPIO_PIN_RESET);
	tx_thread_sleep(100U);

	/* Power ON sequence */
	/* Set STMD_PWR_EN_Pin to 1 (initial state) */
	HAL_GPIO_WritePin(STMD_PWR_EN_GPIO_Port, STMD_PWR_EN_Pin, GPIO_PIN_SET);
	tx_thread_sleep(5);

	/* Set STMD_PWR_EN_Pin to 0 during at least 30ms */
	HAL_GPIO_WritePin(STMD_PWR_EN_GPIO_Port, STMD_PWR_EN_Pin, GPIO_PIN_RESET);
	tx_thread_sleep(4);

	/* Set STMD_PWR_EN_Pin to 1 during at least 500ms */
	HAL_GPIO_WritePin(STMD_PWR_EN_GPIO_Port, STMD_PWR_EN_Pin, GPIO_PIN_SET);
	tx_thread_sleep(65U);

