bahmed-bm/embedded-wireless-framework/examples/STM32U585_Discovery_GCC/ewf_test_tx_bg96_stmod/Core/Src/main.c
	/* Set STMD_PWR_EN_Pin to 0 */
	HAL_GPIO_WritePin(STMD_PWR_EN_GPIO_Port, STMD_PWR_EN_Pin, GPIO_PIN_RESET);

	HAL_GPIO_WritePin(STMD_EN_GPIO_Port, STMD_EN_Pin, GPIO_PIN_SET);

	/* wait for the modem to be in ready state  */
	printf("Waiting for BG96 modem to be ready after power ON\n");
	tx_thread_sleep(TX_TIMER_TICKS_PER_SECOND * 10);
	printf("Modem Ready!!!\n");

	/* set DTR to 1 */
	HAL_GPIO_WritePin(STMD_DTR_GPIO_Port, STMD_DTR_Pin, GPIO_PIN_SET);

	/* Initialize UART3 */
	MX_USART3_UART_Init();
}


#if(MODEM_TYPE == RENESAS_RYZ024A)
void sample_thread_entry(ULONG parameter)
{
    ewf_result result;

    ewf_allocator* message_allocator_ptr = NULL;
    ewf_interface* interface_ptr = NULL;
    ewf_adapter* adapter_ptr = NULL;

    EWF_ALLOCATOR_THREADX_STATIC_DECLARE(message_allocator_ptr, message_allocator,
        EWF_CONFIG_MESSAGE_ALLOCATOR_BLOCK_COUNT,
        EWF_CONFIG_MESSAGE_ALLOCATOR_BLOCK_SIZE);

    EWF_ALLOCATOR_THREADX_STATIC_DECLARE(message_allocator_ptr, message_allocator,
        EWF_CONFIG_MESSAGE_ALLOCATOR_BLOCK_COUNT,
        EWF_CONFIG_MESSAGE_ALLOCATOR_BLOCK_SIZE);
    EWF_INTERFACE_STM32_UART_STATIC_DECLARE(interface_ptr, stm32_uart_port, &huart3);
    EWF_ADAPTER_RENESAS_RYZ024A_STATIC_DECLARE(adapter_ptr, renesas_ryz024a, message_allocator_ptr, NULL, interface_ptr);

	/* Power on the STMOD+ BG96 modem */
    ewf_quectel_bg96_power_on();


    // Start the adapter
    if (ewf_result_failed(result = ewf_adapter_start(adapter_ptr)))
    {
        EWF_LOG_ERROR("Failed to start the adapter, ewf_result %d.\n", result);
        exit(result);
    }
    else
    {
        EWF_LOG("Adapter Start.\n");
    }

    // Set the ME functionality to minimum to clear out any previous connections
    if (ewf_result_failed(result = ewf_adapter_modem_functionality_set(adapter_ptr, EWF_ADAPTER_MODEM_FUNCTIONALITY_MINIMUM)))
    {
        EWF_LOG("[Warning][Failed to the ME functionality]\n");
    }
    else
    {
        EWF_LOG("Modem functionality set to EWF_ADAPTER_MODEM_FUNCTIONALITY_MINIMUM\n");
    }

    // Set the APN
    /*
    if (ewf_result_failed(result = ewf_adapter_modem_pdp_apn_set(adapter_ptr, EWF_CONFIG_CONTEXT_ID, EWF_ADAPTER_MODEM_PDP_TYPE_IP, EWF_CONFIG_SIM_APN)))
    {
        EWF_LOG_ERROR("Failed to the set APN, ewf_result %d.\n", result);
        exit(result);
    }
    else
    {
        EWF_LOG("APN Set to %s\n", EWF_CONFIG_SIM_APN);
    }*/

    // Set the ME functionality
    if (ewf_result_failed(result = ewf_adapter_modem_functionality_set(adapter_ptr, EWF_ADAPTER_MODEM_FUNCTIONALITY_FULL)))
    {
        EWF_LOG_ERROR("Failed to the ME functionality, ewf_result %d.\n", result);
        return;
    }
    else
    {
        EWF_LOG("Modem functionality set to EWF_ADAPTER_MODEM_FUNCTIONALITY_FULL\n");
    }


    /* Wait time for modem to be ready after modem is registered to network */
    ewf_platform_sleep(200);

    // Set the SIM PIN
    if (0) //ewf_result_failed(result = ewf_adapter_modem_sim_pin_enter(adapter_ptr, EWF_CONFIG_SIM_PIN))) bahmed
    {
        EWF_LOG_ERROR("Failed to the SIM PIN, ewf_result %d.\n", result);
        exit(result);
    }
    else
    {
        EWF_LOG("SIM PIN Set.\n");
    }

    if (ewf_result_failed(result = ewf_adapter_modem_network_registration_check(adapter_ptr, EWF_ADAPTER_MODEM_CMD_QUERY_EPS_NETWORK_REG, 1000)))
    {
        EWF_LOG("[ERROR][Failed to register to network.]\n");
        return;
    }
	else
	{
		EWF_LOG("Registered to network.\n");
	}

    // Call the NetX Duo test example
    if (ewf_result_failed(result = ewf_example_netx_duo_ppp_test(adapter_ptr)))
    {
        EWF_LOG_ERROR("The NetX Duo test example failed, ewf_result %d.\n", result);
        exit(result);
    }
    	else
	{
		EWF_LOG("The NetX Duo test example passed.\n");
	}

    EWF_LOG("\nDone!\n");

    /* Stay here forever.  */
    while (1)
    {
        EWF_LOG(".");
        ewf_platform_sleep(EWF_PLATFORM_TICKS_PER_SECOND);
    }
}
#endif

void thread_sample_entry(ULONG thread_input)
{
#if(MODEM_TYPE == QUECTEL_BG96)
    ewf_result result;

    ewf_allocator* message_allocator_ptr = NULL;
    ewf_interface* interface_ptr = NULL;
    ewf_adapter* adapter_ptr = NULL;

    EWF_ALLOCATOR_THREADX_STATIC_DECLARE(message_allocator_ptr, message_allocator,
        EWF_CONFIG_MESSAGE_ALLOCATOR_BLOCK_COUNT,
        EWF_CONFIG_MESSAGE_ALLOCATOR_BLOCK_SIZE);
    EWF_INTERFACE_STM32_UART_STATIC_DECLARE(interface_ptr, stm32_uart_port, &huart3);
    EWF_ADAPTER_QUECTEL_BG96_STATIC_DECLARE(adapter_ptr, quectel_bg96, message_allocator_ptr, NULL, interface_ptr);

	/* Power on the STMOD+ BG96 modem */
    ewf_quectel_bg96_power_on();

    /* Start the adapter.  */
    if (ewf_result_failed(result = ewf_adapter_start(adapter_ptr)))
    {
        EWF_LOG_ERROR("Failed to start the adapter, ewf_result %d.\n", result);
        exit(result);
    }

    // Set the SIM PIN
    if (ewf_result_failed(result = ewf_adapter_modem_sim_pin_enter(adapter_ptr, EWF_CONFIG_SIM_PIN)))
    {
        EWF_LOG_ERROR("Failed to the SIM PIN, ewf_result %d.\n", result);
        exit(result);
    }

    // Set the ME functionality
    if (ewf_result_failed(result = ewf_adapter_modem_functionality_set(adapter_ptr, "1")))
    {
        EWF_LOG_ERROR("Failed to the ME functionality, ewf_result %d.\n", result);
        exit(result);
    }

    /* Run the adapter tests.  */
    if (ewf_result_failed(result = ewf_adapter_quectel_bg96_test(adapter_ptr)))
    {
        EWF_LOG_ERROR("Failed to run the adapter test, ewf_result %d.\n", result);
        exit(result);
    }

    EWF_LOG("\nDone!\n");

    /* Stay here forever.  */
    while (1)
    {
        EWF_LOG(".");
        tx_thread_sleep(TX_TIMER_TICKS_PER_SECOND);
    }
#endif

#if(MODEM_TYPE == RENESAS_RYZ024A)
	sample_thread_entry(thread_input);
	return;
#endif


